# AnalysisDisplayColorEntry Class

---
Contains one entry of intermediate colors in color settings for analysis display style.
SystemObject Autodesk.Revit.DB.AnalysisAnalysisDisplayColorEntry
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class AnalysisDisplayColorEntry : IDisposable

    Public Class AnalysisDisplayColorEntry
    	Implements IDisposable

    public ref class AnalysisDisplayColorEntry : IDisposable

    type AnalysisDisplayColorEntry =
        class
            interface IDisposable
        end
The AnalysisDisplayColorEntry type exposes the following members.
| Name| Description
---|---|---
| AnalysisDisplayColorEntry|  Constructs a new AnalysisDisplayColorEntry with default settings.
| AnalysisDisplayColorEntry(Color)|  Constructs a color entry with no value assigned.
| AnalysisDisplayColorEntry(Color, Double)|  Constructs a color entry with a specific value assigned.
Top
| Name| Description
---|---|---
| Color|  Color associated with color entry.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| Value|  Value associated with color entry.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the AnalysisDisplayColorEntry
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| HasValue|  Check if color entry has associated value.
| IsEqual|  Compare color entries.
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB.Analysis Namespace